{
    "profile": {
        "bio": {
            "rarity": 5,
            "weapon": "sword",
            "element": "Anemo",
            "real_name": "Kaedehara Kazuha",
            "sex": "Male",
            "birthday": "October 29th",
            "constellation": "Acer Palmatum",
            "nation": "Inazuma",
            "special_dish": "All-Weather Beauty",
            "release_date": "June 29, 2021"
        },
        "voice_actors": {
            "english": "Mark Whitten",
            "chinese": "Banma (斑马)",
            "japanese": "Nobunaga Shimazaki (岛崎信长)",
            "korean": "Kim Shin-woo (김신우)"
        },
        "introduction": {
            "quote": "A wandering samurai from Inazuma with a modest and gentle personality.\nBeneath a youthful and carefree demeanor lies a heart that hides a great many burdens from the past. Seemingly easygoing, Kazuha has his own code of conduct.",
            "content": "Kaedehara Kazuha ( Japanese: 楓かえで原はら万かず葉は Kaedehara Kazuha ) [Note 1] is a playable Anemo  character in Genshin Impact. A wandering samurai of the once-famed Kaedehara Clan, Kazuha is a temporary crewmember of The Crux after being declared a criminal by the Raiden Shogun for taking a Vision from her grasp.[4]"
        },
        "personality": {
            "quote": "A wandering samurai from Inazuma who is currently with Liyue's Crux Fleet. A gentle and carefree soul whose heart hides a great many burdens from the past.",
            "content": [
                "Kazuha is a polite and well spoken individual. Compared to other noble Inazuman clan members, Kazuha prefers going out and travelling rather than staying put indoors, something that the seizure of his clan home let him do due to a lack of wealth and duty. He roamed Inazuma peacefully as a modest wanderer for a good portion of his life, teaching himself bladework and picking up other skills, never seeking luxury. He is instead easily pleased just by sleeping on a sun warmed rock. The time he spends outdoors makes him attuned to nature and the wind, being able to \"hear\" and \"smell\" everything around him with absolute clarity. He can sense dangers, read people, and track them down in an instant, no matter how well they try to conceal it. Due to this sensitivity he prefers calm weather and never stays in one place for too long, having trouble sleeping for the former and having his skills stagnate for the latter.\n",
                "Kazuha is determined in his goals, pursuing them with thoroughness and cunning, but he also takes his time and is easygoing. He is very reflective and thoughtful about all matters, frequently pondering about various topics in his travels. He holds his relationships in high regard, immediately coming out of hiding for his friend and forever grateful to Beidou and Gorou for taking him in when he needed shelter. Kazuha frequently warns others of coming storms and possible trouble, he happily does simple errands, offers advice, and is willing to help others.\n",
                "Fitting in with his Anemo affiliation, Kazuha firmly believes in a concept of freedom - that everyone is entitled to their hopes and dreams and that no one has the right to take them, not even a god. For this reason, he opposes the Raiden Shogun and those who support her. Despite his values, he isn't prideful and can acknowledge the strong fighting prowess and honorable conduct of those he personally disagrees with. He sees his friend's duel as honorable and noble, but also that his subsequent execution by the Raiden Shogun was both fair and justified.\n",
                "He was grieved after the death of his friend and wouldn't speak to any of his fellow crewmembers after joining the Crux, but eventually warmed up to them and is fairly chatty according to Beidou. Kazuha has a very poetic side to him, he enjoys penning haikus in his spare time and is easily inspired, though he claims to not be especially talented at it. As a result of both traveling many places and sailing for long periods of time, Kazuha has grown particularly fond of readily available grilled fish and takes the time to prepare and finish his food slowly. While he is not picky about what he eats, he does not appreciate rushed meals or lazy cooking methods. His most prized possession is his sword that he keeps with him at all times, a source of pride for Kazuha as both an Inazuman and a samurai. He is also incredibly fond of red maple leaves, finding them beautiful and enjoys seeing them rain during autumn. When unable to view such sights, he frequently collects and carries them as a memento to ease any homesickness.\n"
            ]
        },
        "appearance": [
            "Kazuha is a young man with choppy, medium length hair, some of it tied in an off centered ponytail to his right. It is a platinum blonde color, apart from a single orange-red streak on his right. He has red eyes with a yellow hue at the bottom, and he usually has a gentle facial expression.\n",
            "Kazuha's outfit, Falling Leaves, is described to have maple leaf patterns that are the hallmark of his wandering samurai attire. It consists of a grey short sleeved kimono and a black haori coat. Half the coat is worn normally on his left arm, with a flowy orange sleeve decorated with orange and red maple leaves, while the other half is draped behind his waist and secured by an obi belt he wears over top. He wears a black and red scarf with gold accents, and a slanted belt that goes under his right arm and over his left shoulder, where his Anemo vision is pinned behind. The vision is tied to a red tassel decoration, and is near some samurai shoulder plating. He wears red hakama pants with maple leaf designs and black sandals with dark red tights with a black piece of leather on both legs that covers from under his kneecaps to near his feet.\n",
            "He wears black glove plates that protect the backs of his hands and his left forearm. His right hand is instead bandaged, though in the past it was not. A possible result of this change was that after taking his friend's Vision, the last of its energy burned his hand as he fled, though it is unknown if visions act like this. Another possible reason is that bandages commonly help protect against constant sword use, and around the time of the change Kazuha would have needed to take better care of his hands. Kazuha is right handed, and would have began fighting more often after exposing himself. After escaping, he still had to help out as a sailor where his hands would callus.\n"
        ]
    },
    "name": "Kaedehara Kazuha",
    "nickname": "Scarlet Leaves Pursue Wild Waves",
    "combat_info": {
        "base_stats": {
            "special": "Elemental Mastery",
            "data": {
                "0": {
                    "1": [
                        "1,039",
                        "23",
                        "63",
                        "—"
                    ],
                    "20": [
                        "2,695",
                        "60",
                        "163"
                    ]
                },
                "1": {
                    "20": [
                        "3,586",
                        "80",
                        "217",
                        "—"
                    ],
                    "40": [
                        "5,366",
                        "119",
                        "324"
                    ]
                },
                "2": {
                    "40": [
                        "5,999",
                        "133",
                        "363",
                        "28.8"
                    ],
                    "50": [
                        "5,902",
                        "153",
                        "468"
                    ]
                },
                "3": {
                    "50": [
                        "7,747",
                        "172",
                        "468",
                        "57.6"
                    ],
                    "60": [
                        "8,659",
                        "192",
                        "523"
                    ]
                },
                "4": {
                    "60": [
                        "9,292",
                        "206",
                        "562",
                        "57.6"
                    ],
                    "70": [
                        "10,213",
                        "227",
                        "617"
                    ]
                },
                "5": {
                    "70": [
                        "10,846",
                        "241",
                        "656",
                        "86.4"
                    ],
                    "80": [
                        "11,777",
                        "262",
                        "712"
                    ]
                },
                "6": {
                    "80": [
                        "12,410",
                        "276",
                        "750",
                        "115.2"
                    ],
                    "90": [
                        "13,348",
                        "297",
                        "807"
                    ]
                }
            }
        },
        "talents": [
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/d/db/Talent_Garyuu_Bladework.png",
                "name": "Garyuu Bladework",
                "type": "Normal Attack",
                "desc": "Normal Attack: Perform up to 5 rapid strikes.\nCharged Attack: Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack: Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact. If this Plunging Attack is triggered by Chihayaburu, it will be converted to Plunging Attack: Midare Ranzan.\nPlunging Attack: Midare Ranzan: When a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to Anemo DMG and will create a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/2/22/Talent_Chihayaburu.png",
                "name": "Chihayaburu",
                "type": "Elemental Skill",
                "desc": "Unleashes a secret technique as fierce as the rushing wind that pulls objects and opponents towards Kazuha's current position before launching opponents within the AoE, dealing Anemo DMG and lifting Kazuha into the air on a rushing gust of wind.Press: Can be used in mid-air.Hold: Charges up before unleashing greater Anemo DMG over a larger AoE than Press Mode.Plunging Attack: Midare Ranzan: Within 10s of remaining airborne after casting Chihayaburu, Kazuha can unleash a powerful Plunging Attack known as Midare Ranzan.When a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to Anemo DMG. On landing, Kazuha creates a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents. Midare Ranzan's DMG is considered Plunging Attack DMG."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/0/06/Talent_Kazuha_Slash.png",
                "name": "Kazuha Slash",
                "type": "Elemental Burst",
                "desc": "The signature technique of Kazuha's self-styled bladework — a single slash that strikes with the force of the first winds of autumn, dealing AoE Anemo DMG. The blade's passage will leave behind a field named \"Autumn Whirlwind\" that periodically deals AoE Anemo DMG to opponents within its range.Elemental Absorption: If Autumn Whirlwind comes into contact with Hydro/Pyro/Cryo/Electro, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/1/16/Talent_Soumon_Swordsmanship.png",
                "name": "Soumon Swordsmanship",
                "type": "1st Ascension Passive",
                "desc": "If Chihayaburu comes into contact with Hydro/Pyro/Cryo/Electro when cast, Chihayaburu will absorb that element and if Plunging Attack: Midare Ranzan is used before the effect expires, it will deal an additional 200% ATK of the absorbed elemental type as DMG. This will be considered Plunging Attack DMG.Elemental Absorption may only occur once per use of Chihayaburu."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/e/e4/Talent_Poetics_of_Fuubutsu.png",
                "name": "Poetics of Fuubutsu",
                "type": "4th Ascension Passive",
                "desc": "Upon triggering a Swirl reaction, Kaedehara Kazuha will grant all party members a 0.04% Elemental DMG Bonus to the element absorbed by Swirl for every point of Elemental Mastery he has for 8s. Bonuses for different elements obtained through this method can co-exist."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/b/b1/Talent_Cloud_Strider.png",
                "name": "Cloud Strider",
                "type": "Utility Passive",
                "desc": "Decreases sprinting Stamina consumption for your own party members by 20%.Not stackable with Passive Talents that provide the exact same effects."
            }
        ],
        "lvup_mat": [
            [
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a7/Item_Teachings_of_Diligence.png",
                    "amount": 9
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/9/9f/Item_Guide_to_Diligence.png",
                    "amount": 63
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c2/Item_Philosophies_of_Diligence.png",
                    "amount": 114
                }
            ],
            [
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c9/Item_Treasure_Hoarder_Insignia.png",
                    "amount": 18
                },
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/44/Item_Silver_Raven_Insignia.png",
                    "amount": 66
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Golden_Raven_Insignia.png",
                    "amount": 93
                }
            ],
            [
                {
                    "rarity": 5,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/e/e1/Item_Gilded_Scale.png",
                    "amount": 18
                }
            ]
        ],
        "constellation": [
            {
                "level": 1,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/6/6b/Constellation_Scarlet_Hills.png",
                "name": "Scarlet Hills",
                "effect": "Decreases Chihayaburu's CD by 10%.Using Kazuha Slash resets the CD of Chihayaburu."
            },
            {
                "level": 2,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/f/f2/Constellation_Yamaarashi_Tailwind.png",
                "name": "Yamaarashi Tailwind",
                "effect": "The Autumn Whirlwind field created by Kazuha Slash has the following effects:\nIncreases Kaedehara Kazuha's own Elemental Mastery by 200.\nIncreases the Elemental Mastery of characters within the field by 200.\nThe Elemental Mastery-increasing effects of this Constellation do not stack."
            },
            {
                "level": 3,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/c/c3/Constellation_Maple_Monogatari.png",
                "name": "Maple Monogatari",
                "effect": "Increases the Level of Chihayaburu by 3.Maximum upgrade level is 15."
            },
            {
                "level": 4,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/0/07/Constellation_Oozora_Genpou.png",
                "name": "Oozora Genpou",
                "effect": "When Kaedehara Kazuha's Energy is lower than 45, he obtains the following effects:\nPressing or Holding Chihayaburu regenerates 3 or 4 Energy for Kaedehara Kazuha, respectively.\nWhen gliding, Kaedehara Kazuha regenerates 2 Energy per second."
            },
            {
                "level": 5,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/f/f7/Constellation_Wisdom_of_Bansei.png",
                "name": "Wisdom of Bansei",
                "effect": "Increases the Level of Kazuha Slash by 3.Maximum upgrade level is 15."
            },
            {
                "level": 6,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/8/87/Constellation_Crimson_Momiji.png",
                "name": "Crimson Momiji",
                "effect": "After using Chihayaburu or Kazuha Slash, Kaedehara Kazuha gains an Anemo Infusion for 5s. Additionally, each point of Elemental Mastery will increase the DMG dealt by Kaedehara Kazuha's Normal, Charged, and Plunging Attack by 0.2%."
            }
        ],
        "ascensions": [
            [
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/9/93/Item_Vayuda_Turquoise_Sliver.png",
                    "amount": 1
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/6d/Item_Sea_Ganoderma.png",
                    "amount": 3
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c9/Item_Treasure_Hoarder_Insignia.png",
                    "amount": 3
                }
            ],
            [
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Vayuda_Turquoise_Fragment.png",
                    "amount": 3
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1d/Item_Marionette_Core.png",
                    "amount": 2
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/6d/Item_Sea_Ganoderma.png",
                    "amount": 10
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c9/Item_Treasure_Hoarder_Insignia.png",
                    "amount": 15
                }
            ],
            [
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Vayuda_Turquoise_Fragment.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1d/Item_Marionette_Core.png",
                    "amount": 4
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/6d/Item_Sea_Ganoderma.png",
                    "amount": 20
                },
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/44/Item_Silver_Raven_Insignia.png",
                    "amount": 12
                }
            ],
            [
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/3/33/Item_Vayuda_Turquoise_Chunk.png",
                    "amount": 3
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1d/Item_Marionette_Core.png",
                    "amount": 8
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/6d/Item_Sea_Ganoderma.png",
                    "amount": 30
                },
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/44/Item_Silver_Raven_Insignia.png",
                    "amount": 18
                }
            ],
            [
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/3/33/Item_Vayuda_Turquoise_Chunk.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1d/Item_Marionette_Core.png",
                    "amount": 12
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/6d/Item_Sea_Ganoderma.png",
                    "amount": 45
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Golden_Raven_Insignia.png",
                    "amount": 12
                }
            ],
            [
                {
                    "rarity": 5,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/3/32/Item_Vayuda_Turquoise_Gemstone.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1d/Item_Marionette_Core.png",
                    "amount": 20
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/6d/Item_Sea_Ganoderma.png",
                    "amount": 60
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Golden_Raven_Insignia.png",
                    "amount": 24
                }
            ]
        ]
    }
}