{
    "profile": {
        "bio": {
            "rarity": 5,
            "weapon": "polearm",
            "element": "Electro",
            "real_name": "Raiden Ei (Japanese: 雷らい電でん影えい)",
            "sex": "Female",
            "birthday": "June 26th",
            "constellation": "Imperatrix Umbrosa (Story Quest)",
            "nation": "Inazuma",
            "special_dish": "None",
            "release_date": "September 01, 2021"
        },
        "voice_actors": {
            "english": "Anne Yatco",
            "chinese": "Juhuahua (菊花花)",
            "japanese": "Miyuki Sawashiro (沢城みゆき)",
            "korean": "Park Ji-yoon (박지윤)"
        },
        "introduction": {
            "quote": "The Raiden Shogun is the awesome and terrible power of thunder incarnate, the exalted ruler of the Inazuma Shogunate.\nWith the might of lightning at her disposal, she commits herself to the solitary pursuit of eternity.",
            "content": "The Raiden Shogun ( Japanese: 雷らい電でん将しょう軍ぐん Raiden Shougun ), real name Raiden Ei ( Japanese: 雷らい電でん影えい Raiden Ei ), is a playable Electro  character in Genshin Impact. She controls a puppet while meditating inside the Plane of Euthymia. Her current form is the vessel of Beelzebul, the current Electro Archon of Inazuma."
        },
        "personality": {
            "quote": "Her Excellency, the Almighty Narukami Ogosho, who promised the people of Inazuma an unchanging Eternity",
            "content": [
                "The Raiden Shogun is a firm believer of what she believes to be eternity—a place in which everything is kept the same, regardless of what goes on. She is honorable in her conduct and is revered by the people of Inazuma.\n",
                "The Raiden Shogun exists in two forms—Raiden Ei, her true identity, and the Shogun, a puppet created by Ei to act as the ruler of Inazuma in her stead while she meditates in the Plane of Euthymia. This puppet follows a set of directives programmed into her, which are extremely hard to modify even by Ei herself. The Shogun is cold and stern in personality, even callous at times; she is limited in emotional expression, has no likes and dislikes, and has no need for recreation. The Shogun thinks of herself as Ei's assistant, and does exactly as she wishes, no more and no less; she cannot act without Ei's direction, and if her usual functions are disabled, the Shogun becomes incapable of doing anything. Due to her limited protocols and Ei's indifference for anything other than her goal of eternity, the puppet can easily be manipulated by outside forces. For example, the Kujou Clan and the Fatui tricked her into initiating and maintaining the Vision Hunt Decree.\n",
                "While Ei has a more stern demeanor than the average person, she is notably more emotive and sociable than the Shogun. Unlike the Shogun, Ei has preferences, such as a love for sweets. Due to her dedication to eternity, Ei is wary of the idea of change. However, she shows curiosity rather than disdain when it comes to new things, such as the appearance of the Traveler and the customs of the modern world. Due to having lost many of her loved ones over the centuries, Ei is driven by a fear of further loss, wanting to preserve Inazuma for all eternity. To this end, she sealed herself in the Plane of Euthymia to keep herself from the effects of erosion, while she created the puppet Shogun to be immune to the decay of the physical body. While in the Plane of Euthymia, Ei was indifferent to anything that did not affect her pursuit of eternity and had a low opinion of human ambition due to ambition leading to loss and suffering, thus making it incompatible with eternity. Even in the Plane of Euthymia, however, she could not truly escape loneliness, as she was happy to see her friend Yae Miko again, and she appears to enjoy the Traveler and Paimon's company.\n",
                "Ei has a weakness against desserts and sweet things. Her view is that desserts can't pose any serious obstacle to her pursuit of Eternity to the extent that in any case of cavities, she could just replace her tooth. Yae Miko and Venti also mentioned about her fondness against desserts, with the Anemo Archon even suggesting that the Traveler bring her desserts to exploit the said vulnerability. During her story quest, when asked by Traveler, Ei explained that since humans enjoyed desserts, she should enjoy it as well. Ei also has an aversion to cooking, saying that she can do anything but that.\n",
                "In spite of her flawed actions, Ei truly loves Inazuma as her sister did and just wants to protect it and her subjects for all eternity. After she was convinced that her actions were wrong, Ei shows remorse on her prior conduct and is willing to change her ways in governing Inazuma so as to avoid repeating her past mistakes.\n"
            ]
        },
        "appearance": [
            "The Raiden Shogun is an adult woman with long braided violet hair behind her back and a hairpin, which belonged to Beelzebul's twin sister, Raiden Makoto, on her right side. She wears a small crimson ribbon on her neck as a choker. Her kimono has an assortment of patterns in different shades of purple and crimson, along with a badge bearing the emblem of Inazuma tied to the front of her clothing below her right breast and a more elaborate emblem on a pauldron on her left shoulder. She wears dark purple thigh-high tights with small diamond openings at the top. On the back of her outfit, she wears a crimson bow with tassels. She also wears high-heeled sandals; the one on the right is adorned with two pale violet flowers.\n",
            "Unlike the other known Archons, she does not appear to wear a 'fake' vision, as none of the electro gems on her clothing appear in the shape of a typical Inazuman vision. Instead, all three of these emblems (one tied to her lower chest, another on the 'fan' on her back and another on her pauldron) all glow faintly when her elemental burst is charged, somewhat similar to how the Traveler's clothing glows.\n"
        ]
    },
    "name": "Raiden Shogun",
    "nickname": "Plane of Euthymia",
    "combat_info": {
        "constellation": [
            {
                "level": 1,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/2/24/Constellation_Ominous_Inscription.png",
                "name": "Ominous Inscription",
                "effect": "Chakra Desiderata will gather Resolve even faster. When Electro characters use their Elemental Bursts, the Resolve gained is increased by 80%. When characters of other Elemental Types use their Elemental Bursts, the Resolve gained is increased by 20%."
            },
            {
                "level": 2,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/4/4e/Constellation_Steelbreaker.png",
                "name": "Steelbreaker",
                "effect": "While using Musou no Hitotachi and in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, the Raiden Shogun's attacks ignore 60% of opponents's DEF."
            },
            {
                "level": 3,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/4/4d/Constellation_Shinkage_Bygones.png",
                "name": "Shinkage Bygones",
                "effect": "Increases the Level of Secret Art: Musou Shinsetsu by 3.Maximum upgrade level is 15."
            },
            {
                "level": 4,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/c/c4/Constellation_Pledge_of_Propriety.png",
                "name": "Pledge of Propriety",
                "effect": "When the Musou Isshin state applied by Secret Art: Musou Shinsetsu expires, all nearby party members (excluding the Raiden Shogun) gain 30% bonus ATK for 10s."
            },
            {
                "level": 5,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/8/85/Constellation_Shogun%27s_Descent.png",
                "name": "Shogun's Descent",
                "effect": "Increases the Level of Transcendence: Baleful Omen by 3.Maximum upgrade level is 15."
            },
            {
                "level": 6,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/5/5e/Constellation_Wishbearer.png",
                "name": "Wishbearer",
                "effect": "While in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, attacks by the Raiden Shogun that are considered part of her Elemental Burst will decrease all nearby party members' (but not including the Raiden Shogun herself) Elemental Burst CD by 1s when they hit opponents.\nThis effect can trigger once every 1s, and can trigger a total of 5 times during the state's duration."
            }
        ],
        "base_stats": {
            "data": {
                "0": {
                    "1": [
                        "1,005",
                        "26",
                        "61"
                    ],
                    "20": [
                        "2,606",
                        "68",
                        "159"
                    ]
                },
                "1": {
                    "20": [
                        "3,468",
                        "91",
                        "212"
                    ],
                    "40": [
                        "5,189",
                        "136",
                        "317"
                    ]
                },
                "2": {
                    "40": [
                        "5,801",
                        "152",
                        "355"
                    ],
                    "50": [
                        "6,675",
                        "175",
                        "408"
                    ]
                },
                "3": {
                    "50": [
                        "7,491",
                        "196",
                        "458"
                    ],
                    "60": [
                        "8,373",
                        "219",
                        "512"
                    ]
                },
                "4": {
                    "60": [
                        "8,985",
                        "235",
                        "549"
                    ],
                    "70": [
                        "9,875",
                        "258",
                        "604"
                    ]
                },
                "5": {
                    "70": [
                        "10,487",
                        "274",
                        "641"
                    ],
                    "80": [
                        "11,388",
                        "298",
                        "696"
                    ]
                },
                "6": {
                    "80": [
                        "12,000",
                        "314",
                        "737"
                    ],
                    "90": [
                        "12,907",
                        "337",
                        "789"
                    ]
                }
            }
        },
        "ascensions": [
            [
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/3/39/Item_Vajrada_Amethyst_Sliver.png",
                    "amount": 1
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/8/8a/Item_Amakumo_Fruit.png",
                    "amount": 3
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/e/e2/Item_Old_Handguard.png",
                    "amount": 3
                }
            ],
            [
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/cb/Item_Vajrada_Amethyst_Fragment.png",
                    "amount": 3
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/2/28/Item_Storm_Beads.png",
                    "amount": 2
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/8/8a/Item_Amakumo_Fruit.png",
                    "amount": 10
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/e/e2/Item_Old_Handguard.png",
                    "amount": 15
                }
            ],
            [
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/cb/Item_Vajrada_Amethyst_Fragment.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/2/28/Item_Storm_Beads.png",
                    "amount": 4
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/8/8a/Item_Amakumo_Fruit.png",
                    "amount": 20
                },
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Kageuchi_Handguard.png",
                    "amount": 12
                }
            ],
            [
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c1/Item_Vajrada_Amethyst_Chunk.png",
                    "amount": 3
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/2/28/Item_Storm_Beads.png",
                    "amount": 8
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/8/8a/Item_Amakumo_Fruit.png",
                    "amount": 30
                },
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Kageuchi_Handguard.png",
                    "amount": 18
                }
            ],
            [
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c1/Item_Vajrada_Amethyst_Chunk.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/2/28/Item_Storm_Beads.png",
                    "amount": 12
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/8/8a/Item_Amakumo_Fruit.png",
                    "amount": 45
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/4e/Item_Famed_Handguard.png",
                    "amount": 12
                }
            ],
            [
                {
                    "rarity": 5,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/b/be/Item_Vajrada_Amethyst_Gemstone.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/2/28/Item_Storm_Beads.png",
                    "amount": 20
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/8/8a/Item_Amakumo_Fruit.png",
                    "amount": 60
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/4e/Item_Famed_Handguard.png",
                    "amount": 24
                }
            ]
        ],
        "talents": [
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/8/8f/Talent_Origin.png",
                "name": "Origin",
                "type": "Normal Attack",
                "desc": "Normal Attack: Performs up to 5 consecutive spear strikes.\nCharged Attack: Consumes a certain amount of Stamina to perform an upward slash.\nPlunging Attack: Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/3/3c/Talent_Transcendence_Baleful_Omen.png",
                "name": "Transcendence: Baleful Omen",
                "type": "Elemental Skill",
                "desc": "The Raiden Shogun unveils a shard of her Euthymia, dealing Electro DMG to nearby opponents, and granting nearby party members the Eye of Stormy Judgment.\nEye of Stormy Judgment\n\nWhen characters with this buff attack and deal DMG to opponents, the Eye will unleash a coordinated attack, dealing AoE Electro DMG at the opponent's position.\nCharacters who gain the Eye of Stormy Judgment will have their Elemental Burst DMG increased based on the Energy Cost of the Elemental Burst during the Eye's duration.The Eye can initiate one coordinated attack every 0.9s per party.Coordinated attacks generated by characters not controlled by you deal 20% of the normal DMG."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/e/e0/Talent_Secret_Art_Musou_Shinsetsu.png",
                "name": "Secret Art: Musou Shinsetsu",
                "type": "Elemental Burst",
                "desc": "Gathering truths unnumbered and wishes uncounted, the Raiden Shogun unleashes the Musou no Hitotachi and deals AoE Electro DMG, using Musou Isshin in combat for a certain duration afterward. The DMG dealt by Musou no Hitotachi and Musou Isshin's attacks will be increased based on the number of Chakra Desiderata's Resolve stacks consumed when this skill is used.\nMusou Isshin\nWhile in this state, the Raiden Shogun will wield her tachi in battle, while her Normal, Charged, and Plunging Attacks will be infused with Electro DMG, which cannot be overridden. When such attacks hit opponents, she will regenerate Energy for all nearby party members. Energy can be restored this way once every 1s, and this effect can be triggered 5 times throughout this skill's duration.While in this state, the Raiden Shogun's resistance to interruption is increased, and she is immune to Electro-Charged reaction DMG.While Musou Isshin is active, the Raiden Shogun's Normal, Charged, and Plunging Attack DMG will be considered Elemental Burst DMG.The effects of Musou Isshin will be cleared when the Raiden Shogun leaves the field.\nChakra Desiderata\nWhen nearby party members (excluding the Raiden Shogun herself) use their Elemental Bursts, the Raiden Shogun will build up Resolve stacks based on the Energy Cost of these Elemental Bursts.\nThe maximum number of Resolve stacks is 60. The Resolve gained by Chakra Desiderata will be cleared 300s after the Raiden Shogun leaves the field."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/b/bc/Talent_Wishes_Unnumbered.png",
                "name": "Wishes Unnumbered",
                "type": "1st Ascension Passive",
                "desc": "When nearby party members gain Elemental Orbs or Particles, Chakra Desiderata gains 2 Resolve stacks.This effect can occur once every 3s."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/b/b7/Talent_Enlightened_One.png",
                "name": "Enlightened One",
                "type": "4th Ascension Passive",
                "desc": "Each 1% above 100% Energy Recharge that the Raiden Shogun possesses grants her:\n0.6% greater Energy restoration from Musou Isshin\n0.4% Electro DMG Bonus"
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/0/0e/Talent_All-Preserver.png",
                "name": "All-Preserver",
                "type": "Utility Passive",
                "desc": "Mora expended when ascending Swords and Polearms is decreased by 50%."
            }
        ],
        "talent_levening_mat": [
            {
                "ascensions_req": "2",
                "cost": "12,500",
                "materials": [
                    {
                        "rarity": 1,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/e/e2/Item_Old_Handguard.png",
                        "amount": 6
                    },
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/5/5e/Item_Teachings_of_Light.png",
                        "amount": 3
                    }
                ]
            },
            {
                "ascensions_req": "3",
                "cost": "17,500",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Kageuchi_Handguard.png",
                        "amount": 3
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/fe/Item_Guide_to_Light.png",
                        "amount": 2
                    }
                ]
            },
            {
                "ascensions_req": "3",
                "cost": "25,000",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Kageuchi_Handguard.png",
                        "amount": 4
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/fe/Item_Guide_to_Light.png",
                        "amount": 4
                    }
                ]
            },
            {
                "ascensions_req": "4",
                "cost": "30,000",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Kageuchi_Handguard.png",
                        "amount": 6
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/fe/Item_Guide_to_Light.png",
                        "amount": 6
                    }
                ]
            },
            {
                "ascensions_req": "4",
                "cost": "37,500",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/71/Item_Kageuchi_Handguard.png",
                        "amount": 9
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/fe/Item_Guide_to_Light.png",
                        "amount": 9
                    }
                ]
            },
            {
                "ascensions_req": "5",
                "cost": "120,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/4e/Item_Famed_Handguard.png",
                        "amount": 4
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/9/95/Item_Philosophies_of_Light.png",
                        "amount": 4
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/44/Item_Molten_Moment.png",
                        "amount": 1
                    }
                ]
            },
            {
                "ascensions_req": "5",
                "cost": "260,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/4e/Item_Famed_Handguard.png",
                        "amount": 6
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/9/95/Item_Philosophies_of_Light.png",
                        "amount": 6
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/44/Item_Molten_Moment.png",
                        "amount": 1
                    }
                ]
            },
            {
                "ascensions_req": "6",
                "cost": "450,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/4e/Item_Famed_Handguard.png",
                        "amount": 9
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/9/95/Item_Philosophies_of_Light.png",
                        "amount": 12
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/44/Item_Molten_Moment.png",
                        "amount": 2
                    }
                ]
            },
            {
                "ascensions_req": "6",
                "cost": "700,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/4e/Item_Famed_Handguard.png",
                        "amount": 12
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/9/95/Item_Philosophies_of_Light.png",
                        "amount": 16
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/44/Item_Molten_Moment.png",
                        "amount": 2
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/0/04/Item_Crown_of_Insight.png",
                        "amount": 1
                    }
                ]
            }
        ]
    },
    "availability": {
        "availability": null,
        "paimon_bargain": null,
        "event_wishes": [
            {
                "image": "Wish_Reign_of_Serenity_2021-09-01.png",
                "name": "Reign of Serenity/2021-09-01",
                "item": [
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/5/52/Character_Raiden_Shogun_Thumb.png",
                        "text": "Raiden",
                        "icon": "Electro"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/61/Character_Sucrose_Thumb.png",
                        "text": "Sucrose",
                        "icon": "Anemo"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/9/96/Character_Kujou_Sara_Thumb.png",
                        "text": "Kujou Sara",
                        "icon": "Electro"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a0/Character_Xiangling_Thumb.png",
                        "text": "Xiangling",
                        "icon": "Pyro"
                    }
                ]
            }
        ]
    },
    "stories": {
        "stories": {
            "Character Details": [
                "Since the dawn of life, humankind has always borne an intense yearning for and curiosity about the world. This is the anchor point of their cognition and is the foundation of all reason.",
                "The world of the people of **Inazuma** is also thus. There, thunder, lightning, wind, and rain were primordial facts of life, as well as light, and the sea... and the Raiden Shogun.",
                "{{Not a typo|Babes}} nestling in their mothers' arms hear tales of the Shogun's slaying of many gods and conquering of other races.",
                "When young men and women roam the islands, they see the gorge split asunder by a blade of lightning and the pale, still-standing bones of the **Orobaxi|giant snake**.",
                "Soldiers take to the battlefield with \"glory to the Shogun and her everlasting reign!\" upon their lips.",
                "The people work in contentment and peace, knowing that the Shogun and her loyal **Tri-Commission** are there.",
                "The great name of the Raiden Shogun has long shaken off the shackles of mere life, becoming the eternal traditional belief of Inazuma.",
                "People trust in this great name and its might, believing that their descendants shall witness the same sights, that the same faith will form the foundations of their inner worlds, and that this will pass on from generation to generation.",
                "This is the eternal paradise that the Almighty Shogun promised her people."
            ],
            "Story 1": [
                "The true name of the Raiden Shogun is \"**Beelzebul|Raiden Ei**.\"",
                "In her long road, she has witnessed the price that Inazuma has had to pay for progress over the hundreds and thousands of years.",
                "The happiest years of her life had passed her by, and those she once considered friends became her foes. In the end, she even lost the reason for which she had wielded her sword.",
                "\"Where there is progress, there must be loss.\"",
                "Ei believed that this was the iron-clad rule of the world, with time as its merciless enforcer.",
                "**Khaenri'ah|The greatest and most prosperous nation of men** collapsed overnight, and even that most ancient **Liyue Harbor** would say farewell to its **Morax|Geo Archon**. The winds of parting came whistling in from the outer edge of time.",
                "However resounding the Raiden Shogun's name, centuries later, millennia later... Someday, Inazuma would lose the protection of its deity.",
                "As a warrior, she was wary of all foes. Even if that enemy was a crisis as intangible as time's passage, she had to find a countermeasure, a weapon she could use to defeat it in time.",
                "Her answer? \"Eternity.\" Only Eternity could freeze all things under the sky, make Inazuma truly deathless.",
                "\"Then, while things are still good, let us have stillness... Let us march towards Eternity.\""
            ],
            "Story 2": [
                "For beings with a perishable form of flesh to pursue Eternity, they must first solve the unavoidable problem of lifespan.",
                "This limited time troubled Ei greatly, until one day when a mysterious technique came before her eyes as if by a stroke of fate.",
                "Using such techniques, one could create intricate puppets indistinguishable from true life.",
                "In theory, this puppet could perfectly imitate everything about Ei. It could surpass the limits of her lifespan and defend Inazuma forever. Yet, how could creating a copy of an **Gods|Archon** be a simple affair?",
                "Ei conducted countless experiments to this effect, discarded a great **Scaramouche|many failed products**, and spend an unimaginable amount of time and resources&mdash;",
                "But at last, by her dogged pursuit and warrior's spirit, she was able to create a flawless puppet.",
                "The newborn Raiden Shogun sat there silently, listening to Ei speak all about her, \"her,\" and even about them. The future of Inazuma was here, inscribed upon a gorgeous blueprint.",
                "The automaton had but one question to ask Ei: \"There is no turning back from forsaking your form. Do you regret nothing?\"",
                "\"Your existence is my answer.\"",
                "Then, Ei transferred her consciousness into her blade, and thus was born the Plane of Euthymia."
            ],
            "Story 3": [
                "Before Raiden Ei became the Shogun, she was a samurai responsible for seeing that the previous Shogun's orders were carried out.",
                "The previous Electro Archon, **Raiden Makoto**, was no great fighter, and the things Ei had charge over were mostly matters of warfare and slaughter. However, Ei also had moments of repose away from battle, sitting with her friends under the sakura trees and playing karuta.",
                "Due to her character, Ei was always the most wooden player. She was never the final victor, nor did she ever have a taste of the prizes that the **Kitsune Saiguu** reserved for the winners.",
                "Thus, she poured the effort that she put into swordsmanship into karuta practice, often pestering Makoto or **Mikoshi Chiyo** to karuta matches, or spending much time by moonlight reading the poetry inscribed on the cards out loud.",
                "At last, the day came that under the sakura trees, Ei would defeat opponent after opponent. Even the mighty **tengu** would be felled after a hard-fought battle, and thus was she crowned the champion.",
                "Ei let out a victorious whoop at her victory, only to be greeted by the sounds of her friends' laughter. Only then did she realize that she had lost her usual composure entirely, before snapping both arms back down and reverting to her usual cool facade.",
                "Of course, her friends did not intend to make sport of her. Indeed, they understood her character and the manner in which she had worked ever so hard to come out on top.",
                "As for the Kitsune Saiguu, oh, how amused she looked as she presented Ei with some pastries.",
                "\"I said it was a reward, yes, but it was simply some hand-made cakes of mine. I didn't think that you would be so concerned about it, Ei. Well then, enjoy the spoils of your victory to your heart's content.\"",
                "Ei was hardly one to be greedy for snacks. But as a samurai, she firmly believed that what she lost must be reclaimed. These pastries were more akin to a vindication of her desire to win.",
                "&mdash;But it was not long before that cool demeanor of hers broke into a smile again. The cakes were lovely &mdash; just like the taste of victory. As for her clumsy attempts to hide that smile, one could only say that it was an entertaining sight all around for her friends.",
                "To this day, Ei still often remembers that sakura tree.",
                "...Even though she has not gone to see it in a long time, and even though no one sits under it anymore, she wishes that time might stop forever."
            ],
            "Story 4": [
                "Ei still remembers the way in which Makoto greatly loved the scenery of Inazuma, its cuisine, and the stories of its people &mdash; and how she loved telling Ei all about it.",
                "Though they both understood the concept of erosion well, Makoto was unlike Ei, who worried about the future more often. Instead, Makoto's energies were focused on the present.",
                "\"It is precisely because we know that this scene is but a fleeting shadow that we should enjoy it all the more.\"",
                "Then, Ei could only smile wryly, realizing that she, the kagemusha, was even more old-fashioned than the real Raiden Shogun. She thought to herself that she must learn to be more leisurely, just like Makoto.",
                "Yet the times changed all too quickly, all but catching Ei off guard. Before she knew it, her hands already held the blade that the dying Raiden Makoto had passed on to her.",
                "This day, the kagemusha was now the true Raiden Shogun.",
                "And it was on this day that Ei truly felt the agony of erosion.",
                "As time marched forward inexorably, even this blade, this sakura... All life on Inazuma would fade before her eyes.",
                "This was the foundation of Inazuma, and it was the thing that the Raiden Shogun must defend.\n\"If you look at this way, thinking ahead is not meaningless, nor is it vain arrogance.\"",
                "Having resolved herself, her life exceeded its mortal shell, and eternity descended upon the mortal plane."
            ],
            "Story 5": [
                "One night, Raiden Ei entered a beautiful dreamscape while meditating.",
                "Here, there was nothing left between heaven and earth but her, and a \"her\" that was akin to looking into a mirror.",
                "The automaton's voice flowed into her ears like a sigh: \"the eternity you resolved to establish in your heart has been shaken by the countless wishes of the people. Thus, you have become my enemy.\"",
                "Back when she was creating the puppet, Ei had considered all the hidden risks involved.",
                "She believed that anything was possible &mdash; including the worst-case scenario... in which she too would someday become a threat to Eternity.",
                "But she had to press on. She had to reach Eternity. This, she would not permit to be stayed by any outside force.",
                "The puppet's words were something that she had asked herself long ago:",
                "\"You believe that you are more firmly convicted now than you were yesterday, and that is why you are presently correct. Is that so?\"",
                "\"Do you presently have some new ideas, or have you, too, fallen victim to inexorable 'eroded'?\"",
                "Their faces were the same, but they spoke of different ideals. The battle with herself, with her past, would come someday.",
                "But it was not this day. Ei knew well that she was not yet ready.",
                "Her heart was clear, and she would have remained in that state, but hearing the cries of her people, she had to command her feet to stop.",
                "The sky above the mirror was no longer empty, and all about the silent halls, she heard the cry of crows. Dawn was coming. The samurai must take up her sword.",
                "This dream was ever so real, and it, too, passed like a shadow."
            ],
            "Musou Isshin": [
                "A sword that, once passed on, has accompanied Ei to this day.",
                "This sword has had two wielders, and has witnessed both time and eternity.",
                "It was born from Raiden Makoto's divine might, but it was never once sharpened. It took after its owner, of course, for Makoto was not one for battle. It was but a symbol, a sign of true peace.",
                "The day Makoto passed on, it was given into Ei's hands. The sword was stained with blood, then, and as the blade drew its first taste of crimson, it was blown aside by wild winds and blazing thunder.",
                "Makoto gave it the name Musou Isshin, and desired to have it witness an Inazuma as lovely as a dream and the noble hearts that dwell in this world.",
                "Ei did not change its name. For she, too, had looked out over that vast scene of beauty, and a stronger that was purer and stronger still was birthed in her heart thereby. The aesthetic of lightning is precisely to capture that which is precious amidst fleeting transience."
            ],
            "Gnosis": [
                "Before she came to dwell in the **Plane of Euthymia** permanently, Ei was troubled for a time concerning where she might store her Gnosis.",
                "She no longer had any need of it, but such an important item could not simply be placed anywhere. She had initially intended to have it modified into an energy supply device, but no matter what she did, her techniques had no effect on the **Gnosis** at all.",
                "And that was when she thought of someone: the cunning and clever **Yae Miko**. She was not precisely someone to be trusted, but she was in many ways also Ei's best choice.",
                "Upon hearing this request, Miko could not help but joke: \"Aren't you afraid that I might just sell this off?\"",
                "\"You understand the value of a Gnosis. Even if you sold it, I trust that you would have exchanged it for something of equal value, and that is no easy price to pay.\"",
                "With someone of Yae Miko's character, it would be no surprise if she ever sold the Gnosis, yes, but she would not allow herself to lose out in any such exchange.",
                "Such, then, was the tacit agreement between the two old friends. Yae Miko understood Ei's intent and took the precious Gnosis with a smile.",
                "\"Well, this is your idea, not mine. Don't end up regretting this, now.\""
            ]
        },
        "namecard": {
            "name": "Raiden Shogun: Enlightenment",
            "image": "https://static.wikia.nocookie.net/gensin-impact/images/e/e3/Item_Raiden_Shogun_Enlightenment.png",
            "obtain": "Reward for reaching Friendship Level 10 with Raiden Shogun",
            "description": "\"Not simply Ei, and not merely the Raiden Shogun. Observe yourself also with one stormy eye, and you will someday reach a breakthrough.\""
        },
        "constellation": {
            "image": "Imperatrix_Umbrosa.png",
            "meaning": "Shadow Empress\n"
        },
        "quests_events": {
            "Archon Quests": "- **Chapter II**\n  - Act II: **Stillness, the Sublimation of Shadow**\n    - **Amidst Stormy Judgment**\n  - Act III: **Omnipresence Over Mortals**",
            "Story Quests": "- **Imperatrix Umbrosa Chapter**\n  - Act I: **Reflections of Mortality**"
        },
        "interactions": {
            "Kaedehara Kazuha": {
                "stories": "yes",
                "voices": "yes"
            },
            "Kamisato Ayaka": {
                "stories": "yes",
                "voices": "yes"
            },
            "Kujou Sara": {
                "stories": "yes",
                "voices": "yes"
            },
            "Sangonomiya Kokomi": {
                "stories": "yes",
                "voices": "yes"
            },
            "Sayu": {
                "stories": "no",
                "voices": "yes"
            },
            "Venti": {
                "stories": "no",
                "voices": "spec"
            },
            "Yoimiya": {
                "stories": "yes",
                "voices": "yes"
            },
            "Zhongli": {
                "stories": "no",
                "voices": "spec"
            }
        }
    }
}