{
    "profile": {
        "bio": {
            "rarity": 5,
            "weapon": "bow",
            "element": "Hydro",
            "real_name": "Ajax",
            "sex": "Male",
            "birthday": "July 20th",
            "constellation": "Monoceros Caeli (Story Quest)",
            "nation": "Snezhnaya",
            "special_dish": "A Prize Catch",
            "release_date": "November 11, 2020"
        },
        "voice_actors": {
            "english": "Griffin Burns",
            "chinese": "Yudong (鱼冻)",
            "japanese": "Ryōhei Kimura (木村良平)",
            "korean": "Nam Doh-hyeong (남도형)"
        },
        "introduction": {
            "quote": "Meet Tartaglia — the cunning Snezhnayan whose unpredictable personality keeps people guessing his every move.\nDon't be under any illusion as to what he might be thinking or what his intentions are. Just remember this: Behind that innocent, childlike exterior lies a finely honed instrument of war.",
            "content": "Tartaglia, also known by his alias \" Childe \", is a playable Hydro  character in Genshin Impact. He is the most recent, the Eleventh, of the Eleven Harbingers of the Fatui. Following danger wherever he goes, Childe is always eager for a challenge, making him extremely dangerous despite being the youngest member."
        },
        "personality": {
            "quote": "No. 11 of The Harbingers, also known as \"Childe.\" His name is highly feared on the battlefield.",
            "content": [
                "Tartaglia describes himself as \"kind of a bad guy\", living for the thrill of a fight and causing chaos.\n",
                "As a child, Tartaglia was frightened and hesitant, but he secretly desired to become an adventurer like the ones his father told him about as they fished together. After falling into The Abyss and meeting and training with Skirk, Tartaglia's personality drastically changed.\n",
                "Although he appears to relatively friendly on the surface, Tartaglia is a bloodthirsty warrior. The Abyss and his old master, Skirk, made him self-confident, solipsistic, and brash, thriving on the sensation of being alive. A warrior at heart, he constantly seeks ways to grow stronger, regardless of how he obtains said power. Tartaglia considers those who wish to become strong like him to be friends and takes pleasure in battling them on the battlefield. He lusts for combat and grows excited by fighting strong opponents, even if it could mean dying in the process. He uses bows because he is weakest with them, making his victories with them all the more exhilarating.\n",
                "Because of his pride, Tartaglia is exceptionally reliable at accomplishing the tasks given to him, no matter how difficult they may be or if they go against his values. This, combined with his straightforward nature, makes him rather easy to manipulate. Despite disliking how his plan in Liyue Harbor could potentially harm innocents, he puts it into motion to fulfill his mission in Liyue — only to learn he was meant to fail as part of an even larger plan he was not privy to, much to his consternation.\n",
                "Amongst the rest of the Harbingers, Tartaglia is considered an oddball. While his fellow Harbingers prefer clandestine operations and staying behind the scenes, Tartaglia favors being front and center. On top of his lust for battle and tendency to cause havoc, he is a public figure known for attending social gatherings and even participates as an actor in plays and theater. As a result, Childe's coworkers are wary of him, while he holds them in disdain for their schemes and \"intangible\" methods. While he is quite capable of scheming, he only resorts to such approaches when necessary due to his straightforward nature. He also appears to treat his subordinates less harshly than the rest of the Harbingers, stating that he doesn't use lethal force against the recruits in his care, nor does he threaten any of them.\n",
                "Tartaglia dedicates himself to those he cares about wholeheartedly. He is unquestionably loyal to the Tsaritsa and holds her in high esteem, seeing himself as her weapon of war. He also cares deeply for his family; he sends money, gifts, and letters home often. Tartaglia is exceptionally proud of his three younger siblings and dotes on them frequently, especially his youngest brother Teucer — he is willing to lie and even put himself in mortal danger, so as long as it makes him happy.  While this is callous, Tartaglia prioritizes his brother's safety over his own. He sees the Traveler as a friend, and enjoys sparring with them. Despite Zhongli deceiving him (and often using him as financial support), he remains on good terms with the former Archon.\n",
                "Tartaglia enjoys fishing, having grown to appreciate fishing with his father before his drastic change. He uses it as a way to meditate, honing his endurance and contemplating his combat techniques. He has no particular preference for meals, declaring that all food is delicious, stating that a true warrior shouldn't fuss over what they eat in a manner similar to the weapon they use.\n"
            ]
        },
        "appearance": [
            "Tartaglia is a tall young man with short, choppy orange hair and dull blue eyes. He wears a red Fatui mask pulled off to one side of his head. He also wears a beaded earring with a red crystal on his left ear. A few lighter blonde streaks can be seen in his hair, with one prominent one on the left side of his bangs.\n",
            "He wears a grey jacket with dark red and light grey details, grey pants, and black boots and gloves. His jacket is left unbuttoned at the end to reveal a belt, which his Hydro Vision is attached to. It is instead held by buttons, with the outer edge decorated by a black symbol. He wears short gloves that expose his wrists. He also wears a red banner that goes across his chest and over his left shoulder, which becomes infused with a wispy Hydro effect when in the melee stance of his Elemental Skill Foul Legacy: Raging Tide. His outfit, Blades of Glory is described to be  illustrious attire that signifies Childe's position as the eleventh Fatui Harbinger.\n",
            "During the Golden House battle, Tartaglia wears his Electro Delusion to the right of his Vision in the center of his belt, and then moves his Vision to the empty slot on his right chest when fully activating the Foul Legacy Transformation.\n"
        ]
    },
    "name": "Tartaglia",
    "nickname": "Childe",
    "combat_info": {
        "constellation": [
            {
                "level": 1,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/f/ff/Constellation_Foul_Legacy_Tide_Withholder.png",
                "name": "Foul Legacy: Tide Withholder",
                "effect": "Decreases the CD of Foul Legacy: Raging Tide by 20%"
            },
            {
                "level": 2,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/0/0e/Constellation_Foul_Legacy_Understream.png",
                "name": "Foul Legacy: Understream",
                "effect": "When opponents affected by Riptide are defeated, Tartaglia regenerates 4 Elemental Energy."
            },
            {
                "level": 3,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/6/6d/Constellation_Abyssal_Mayhem_Vortex_of_Turmoil.png",
                "name": "Abyssal Mayhem: Vortex of Turmoil",
                "effect": "Increases the Level of Foul Legacy: Raging Tide by 3.Maximum upgrade level is 15."
            },
            {
                "level": 4,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/9/9d/Constellation_Abyssal_Mayhem_Hydrospout.png",
                "name": "Abyssal Mayhem: Hydrospout",
                "effect": "If Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, triggers Riptide Slash against opponents on the field affected by Riptide every 4s, otherwise, triggers Riptide Flash.Riptide Slashes and Riptide Flashes triggered by this Constellation effect are not subject to the time intervals that would typically apply to these two Riptide effects, nor do they have any effect on those time intervals."
            },
            {
                "level": 5,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/2/20/Constellation_Havoc_Formless_Blade.png",
                "name": "Havoc: Formless Blade",
                "effect": "Increases the Level of Havoc: Obliteration by 3.Maximum upgrade level is 15."
            },
            {
                "level": 6,
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/5/5a/Constellation_Havoc_Annihilation.png",
                "name": "Havoc: Annihilation",
                "effect": "When Havoc: Obliteration is cast in Melee Stance, the CD of Foul Legacy: Raging Tide is reset.This effect will only take place once Tartaglia returns to his Ranged Stance."
            }
        ],
        "base_stats": {
            "data": {
                "0": {
                    "1": [
                        "1,020",
                        "23",
                        "63"
                    ],
                    "20": [
                        "2,646",
                        "61",
                        "165"
                    ]
                },
                "1": {
                    "20": [
                        "3,521",
                        "81",
                        "219"
                    ],
                    "40": [
                        "5,268",
                        "121",
                        "328"
                    ]
                },
                "2": {
                    "40": [
                        "5,889",
                        "135",
                        "366"
                    ],
                    "50": [
                        "6,776",
                        "156",
                        "421"
                    ]
                },
                "3": {
                    "50": [
                        "7,604",
                        "175",
                        "473"
                    ],
                    "60": [
                        "8,500",
                        "195",
                        "528"
                    ]
                },
                "4": {
                    "60": [
                        "9,121",
                        "210",
                        "567"
                    ],
                    "70": [
                        "10,025",
                        "231",
                        "623"
                    ]
                },
                "5": {
                    "70": [
                        "10,647",
                        "245",
                        "662"
                    ],
                    "80": [
                        "11,561",
                        "266",
                        "719"
                    ]
                },
                "6": {
                    "80": [
                        "12,182",
                        "280",
                        "757"
                    ],
                    "90": [
                        "13,103",
                        "301",
                        "815"
                    ]
                }
            }
        },
        "ascensions": [
            [
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/f8/Item_Varunada_Lazurite_Sliver.png",
                    "amount": 1
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/46/Item_Starconch.png",
                    "amount": 3
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/b/b2/Item_Recruit%27s_Insignia.png",
                    "amount": 3
                }
            ],
            [
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/f6/Item_Varunada_Lazurite_Fragment.png",
                    "amount": 3
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/0/02/Item_Cleansing_Heart.png",
                    "amount": 2
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/46/Item_Starconch.png",
                    "amount": 10
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/b/b2/Item_Recruit%27s_Insignia.png",
                    "amount": 15
                }
            ],
            [
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/f6/Item_Varunada_Lazurite_Fragment.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/0/02/Item_Cleansing_Heart.png",
                    "amount": 4
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/46/Item_Starconch.png",
                    "amount": 20
                },
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a5/Item_Sergeant%27s_Insignia.png",
                    "amount": 12
                }
            ],
            [
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/f4/Item_Varunada_Lazurite_Chunk.png",
                    "amount": 3
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/0/02/Item_Cleansing_Heart.png",
                    "amount": 8
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/46/Item_Starconch.png",
                    "amount": 30
                },
                {
                    "rarity": 2,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a5/Item_Sergeant%27s_Insignia.png",
                    "amount": 18
                }
            ],
            [
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/f4/Item_Varunada_Lazurite_Chunk.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/0/02/Item_Cleansing_Heart.png",
                    "amount": 12
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/46/Item_Starconch.png",
                    "amount": 45
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/d/db/Item_Lieutenant%27s_Insignia.png",
                    "amount": 12
                }
            ],
            [
                {
                    "rarity": 5,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a4/Item_Varunada_Lazurite_Gemstone.png",
                    "amount": 6
                },
                {
                    "rarity": 4,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/0/02/Item_Cleansing_Heart.png",
                    "amount": 20
                },
                {
                    "rarity": 1,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/46/Item_Starconch.png",
                    "amount": 60
                },
                {
                    "rarity": 3,
                    "image": "https://static.wikia.nocookie.net/gensin-impact/images/d/db/Item_Lieutenant%27s_Insignia.png",
                    "amount": 24
                }
            ]
        ],
        "talents": [
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/3/36/Talent_Cutting_Torrent.png",
                "name": "Cutting Torrent",
                "type": "Normal Attack",
                "desc": "Normal Attack: Perform up to 6 consecutive shots with a bow.\nCharged Attack: Perform a more precise Aimed Shot with increased DMG. While aiming, the power of Hydro will accumulate on the arrowhead. An arrow fully charged with the torrent will deal Hydro DMG and apply the Riptide status.\nRiptide: Opponents affected by Riptide will suffer from AoE Hydro DMG effects when attacked by Tartaglia in various ways. DMG dealt in this way is considered Normal Attack DMG.\n\nRiptide Flash: A fully-charged Aimed Shot that hits an opponent affected by Riptide deals consecutive bouts of AoE DMG. Can occur once every 0.7s.\nRiptide Burst: Defeating an opponent affected by Riptide creates a Hydro burst that inflicts the Riptide status on nearby opponents hit.\nPlunging Attack: Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.When Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, he cannot perform a plunging attack."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/b/b5/Talent_Foul_Legacy_Raging_Tide.png",
                "name": "Foul Legacy: Raging Tide",
                "type": "Elemental Skill",
                "desc": "Unleashes a set of weaponry made of pure water, dealing Hydro DMG to surrounding opponents and entering Melee Stance.\nIn this Stance, Tartaglia's Normal and Charged Attacks are converted to Hydro DMG that cannot be overridden by any other elemental infusion and change as follows:\nNormal Attack: Perform up to 6 consecutive Hydro strikes.\nCharged Attack: Consumes a certain amount of Stamina to unleash a cross slash, dealing Hydro DMG.\nRiptide Slash: Hitting an opponent affected by Riptide with a melee attack unleashes a Riptide Slash that deals AoE Hydro DMG. DMG dealt in this way is considered Elemental Skill DMG, and can only occur once every 1.5s.\nAfter 30s, or when the ability is unleashed again, this skill will end. Tartaglia will return to his Ranged Stance and this ability will enter CD. The longer Tartaglia stays in his Melee Stance, the longer the CD. If the return to a ranged stance occurs automatically after 30s, the CD is even longer."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/0/03/Talent_Havoc_Obliteration.png",
                "name": "Havoc: Obliteration",
                "type": "Elemental Burst",
                "desc": "Performs different attacks based on what stance Tartaglia is in when casting.\nRanged Stance: Flash of Havoc: Swiftly fires a Hydro-imbued magic arrow, dealing AoE Hydro DMG and applying the Riptide status. Returns a portion of its Energy Cost after use.\nMelee Stance: Light of Obliteration: Performs a slash with a large AoE, dealing massive Hydro DMG to all surrounding opponents, which triggers Riptide Blast.\nRiptide Blast: When the obliterating waters hit an opponent affected by Riptide, it clears their Riptide status and triggers a Hydro Explosion that deals AoE Hydro DMG. DMG dealt in this way is considered Elemental Burst DMG."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/e/ea/Talent_Never_Ending.png",
                "name": "Never Ending",
                "type": "1st Ascension Passive",
                "desc": "Extends Riptide duration by 8s."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/d/d8/Talent_Sword_of_Torrents.png",
                "name": "Sword of Torrents",
                "type": "4th Ascension Passive",
                "desc": "When Tartaglia is in Foul Legacy: Raging Tide's Melee stance, on dealing a CRIT hit, Normal and Charged Attacks apply the Riptide status effects to opponents."
            },
            {
                "icon": "https://static.wikia.nocookie.net/gensin-impact/images/4/45/Talent_Master_of_Weaponry.png",
                "name": "Master of Weaponry",
                "type": "Utility Passive",
                "desc": "Increases your own party members' Normal Attack Level by 1."
            }
        ],
        "talent_levening_mat": [
            {
                "ascensions_req": "2",
                "cost": "12,500",
                "materials": [
                    {
                        "rarity": 1,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/b/b2/Item_Recruit%27s_Insignia.png",
                        "amount": 6
                    },
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/3/3a/Item_Teachings_of_Freedom.png",
                        "amount": 3
                    }
                ]
            },
            {
                "ascensions_req": "3",
                "cost": "17,500",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a5/Item_Sergeant%27s_Insignia.png",
                        "amount": 3
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1a/Item_Guide_to_Freedom.png",
                        "amount": 2
                    }
                ]
            },
            {
                "ascensions_req": "3",
                "cost": "25,000",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a5/Item_Sergeant%27s_Insignia.png",
                        "amount": 4
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1a/Item_Guide_to_Freedom.png",
                        "amount": 4
                    }
                ]
            },
            {
                "ascensions_req": "4",
                "cost": "30,000",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a5/Item_Sergeant%27s_Insignia.png",
                        "amount": 6
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1a/Item_Guide_to_Freedom.png",
                        "amount": 6
                    }
                ]
            },
            {
                "ascensions_req": "4",
                "cost": "37,500",
                "materials": [
                    {
                        "rarity": 2,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/a/a5/Item_Sergeant%27s_Insignia.png",
                        "amount": 9
                    },
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/1a/Item_Guide_to_Freedom.png",
                        "amount": 9
                    }
                ]
            },
            {
                "ascensions_req": "5",
                "cost": "120,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/d/db/Item_Lieutenant%27s_Insignia.png",
                        "amount": 4
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c4/Item_Philosophies_of_Freedom.png",
                        "amount": 4
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/48/Item_Shard_of_a_Foul_Legacy.png",
                        "amount": 1
                    }
                ]
            },
            {
                "ascensions_req": "5",
                "cost": "260,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/d/db/Item_Lieutenant%27s_Insignia.png",
                        "amount": 6
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c4/Item_Philosophies_of_Freedom.png",
                        "amount": 6
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/48/Item_Shard_of_a_Foul_Legacy.png",
                        "amount": 1
                    }
                ]
            },
            {
                "ascensions_req": "6",
                "cost": "450,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/d/db/Item_Lieutenant%27s_Insignia.png",
                        "amount": 9
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c4/Item_Philosophies_of_Freedom.png",
                        "amount": 12
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/48/Item_Shard_of_a_Foul_Legacy.png",
                        "amount": 2
                    }
                ]
            },
            {
                "ascensions_req": "6",
                "cost": "700,000",
                "materials": [
                    {
                        "rarity": 3,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/d/db/Item_Lieutenant%27s_Insignia.png",
                        "amount": 12
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c4/Item_Philosophies_of_Freedom.png",
                        "amount": 16
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/4/48/Item_Shard_of_a_Foul_Legacy.png",
                        "amount": 2
                    },
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/0/04/Item_Crown_of_Insight.png",
                        "amount": 1
                    }
                ]
            }
        ]
    },
    "availability": {
        "availability": "",
        "paimon_bargain": null,
        "event_wishes": [
            {
                "image": "Wish_Farewell_of_Snezhnaya_2020-11-11.jpg",
                "name": "Farewell of Snezhnaya/2020-11-11",
                "item": [
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/5/53/Character_Tartaglia_Thumb.png",
                        "text": "Tartaglia",
                        "icon": "Hydro"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/b/b9/Character_Diona_Thumb.png",
                        "text": "Diona",
                        "icon": "Cryo"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/2/2b/Character_Ningguang_Thumb.png",
                        "text": "Ningguang",
                        "icon": "Geo"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/6/61/Character_Beidou_Thumb.png",
                        "text": "Beidou",
                        "icon": "Electro"
                    }
                ]
            },
            {
                "image": "Wish_Farewell_of_Snezhnaya_2021-04-06.png",
                "name": "Farewell of Snezhnaya/2021-04-06",
                "item": [
                    {
                        "rarity": 5,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/5/53/Character_Tartaglia_Thumb.png",
                        "text": "Tartaglia",
                        "icon": "Hydro"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/f/f6/Character_Rosaria_Thumb.png",
                        "text": "Rosaria",
                        "icon": "Cryo"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/1/14/Character_Fischl_Thumb.png",
                        "text": "Fischl",
                        "icon": "Electro"
                    },
                    {
                        "rarity": 4,
                        "image": "https://static.wikia.nocookie.net/gensin-impact/images/7/72/Character_Barbara_Thumb.png",
                        "text": "Barbara",
                        "icon": "Hydro"
                    }
                ]
            }
        ]
    },
    "stories": {
        "stories": {
            "Character Details": [
                "Despite holding one of the most senior positions in the **Fatui** as one of the **Eleven Fatui Harbingers|Eleven Harbingers**, Childe very much looks like the young adult that he still is.",
                "He is a wolf in sheep's clothing, however, for under the cheerful and confident appearance lies a deadly swordsman.",
                "He is the youngest among the Harbingers, but one of the most dangerous among their number. That said, Childe doesn't seem to fit in well with the others.",
                "As a fighter first and foremost, he is quite at odds with this organization of deceit and treachery."
            ],
            "Story 1": [
                "As the youngest Harbinger in the history of the Fatui, Childe is hardly bound by convention, and plays by his own rules accordingly.",
                "Though this lone wolf is not so well received by his peers and is also at odds with their methods, his cavalier demeanor hides a responsible, watertight meticulousness.",
                "He is a proud man of his word. Even if the promise he makes is absurd, he will never break it. Be it exterminating all the dragons inside their lairs, venturing into a domain of extreme danger, or single-handedly overthrowing the territory of a nobleman...",
                "He not only keeps his promises, but also does so with finesse and surgical precision..<!--in-game typo--> As the Harbingers' vanguard, Childe always appears in the vulnerable underbellies of **Snezhnaya**'s enemy states, striking as a conflict is about to erupt."
            ],
            "Story 2": [
                "Many myths in Snezhnaya say that Tartaglia has been on the battlefield since he was 14 years old.",
                "Oddly enough, at that young age he already seemed to be a skilled slaughterer with mastery of many forms of martial arts.",
                "But more terrifying than his skill in combat was his passion for it. Perilous battles would only excite him, and terrifying foes would exhilarate him all the more.",
                "Childe's arrogance and conceit are derived from honing himself across countless battles, and from unmatched combat experience.",
                "On the other hand, because they fret about the way his quarrelsome personality tends to invite unwanted trouble, the other Harbingers constantly try to get him sent on missions to places as far from Snezhnaya as possible, so that they can avoid the fallout.",
                "The man is incomprehensibly ever in the eye of the storm, and these unusual experiences have also made him quite the show-off who revels in the praise of others.",
                "Unlike other members of the Harbingers, who prefer to keep a low profile, Tartaglia will often go to watch public performances &mdash; occasionally even becoming part of the show himself."
            ],
            "Story 3": [
                "Ice fishing has been one of Tartaglia's hobbies since childhood.",
                "In those days, he was known neither by the names Tartaglia nor \"Childe,\" as the Fatui call him, but as Ajax, named by his father after some hero's tale. He and his father would cut holes open upon frozen lakes, before sitting beside them and tend to their fishing lines.",
                "This was no easy task, and would sometimes take the entire morning.",
                "But whether it was chiseling away at the thick ice or the long waits in between catches, he was always accompanied by his father's unending tales of adventure.",
                "These were stories of his father's adventures from when he was young, and they became the future that Tartaglia secretly envisioned for himself.",
                "So he would pay close attention, putting himself into the shoes of the protagonist of those tales, immersing himself fully in them even as they waited for a fish to bite.",
                "Even after leaving home, Ajax, later to be known as \"Childe\" Tartaglia, would keep up that hobby of his.",
                "No longer accompanied by the stories of bygone days, fishing instead became an opportunity to train &mdash; to hone his endurance, and reflect on combat techniques.",
                "Such long periods of meditation to refine his skills swiftly relegated the question of a successful catch to irrelevance."
            ],
            "Story 4": [
                "Unlike what the rest of the world may think, Tartaglia was not born with his exceptional skills in battle.",
                "But he would never speak to everyone about that critical fateful encounter of his...",
                "When he was 14, he fled his monotonous life at home with nothing but a shortsword and a bag of bread in hand.",
                "That 14-year-old boy got lost in the snowy forest.",
                "Pursued by bears and wolf packs, he lost his footing and fell into a bottomless crack in the earth's surface.",
                "There, he witnessed the endless possibilities of another ancient world. There, he would meet a mysterious swordswoman...",
                "Or perhaps one should say that this dark realm had sensed the burning ambition in this boy's heart.",
                "This darkness was something that the Harbinger Childe could never again delve into.",
                "In those three months, the swordswoman taught Tartaglia how to pass through the Abyss unhindered, and more importantly, nurtured the ability to stir up endless havoc from within Ajax's trouble-mongering nature.",
                "No one knew what happened within that darkness during those three months, nor would Ajax ever speak of this to anyone. When his worried mother and sisters finally found him in that forest, only 3 days had passed in this world.",
                "Thus did Ajax's first adventure end, with his now-rusty shortsword in hand.",
                "This would mark the end of his youth and the beginning of his days as a warrior."
            ],
            "Story 5": [
                "By the time he returned home, the young man was no longer the same.",
                "He was no longer frightened and hesitant but had become frivolous and confident. He acted as if this world revolved around him, and as if battle existed for his sake.",
                "Conflict often brings about change, and this capricious, incalculable change attracted Ajax like a revolving kaleidoscope.",
                "In the eyes of his father, that third son that he had so worried about had changed for the worse, bringing much havoc uncalled-for to the seaside village of **Morepesok**.",
                "Or perhaps it would be more accurate to say that Ajax had become a nexus of strife, for no matter where he went, fights and squabbles would follow &mdash; and he reveled in it.",
                "Ultimately, after a huge brawl was pacified with some difficulty and with some near-fatal misses, his father had no choice but to hand his beloved son over for conscription into the Fatui.",
                "He hoped that the strict military training of the Fatui could hone his son's temper, but wound up watching fully-armed troops getting the stuffing beaten out of them by a mere child.",
                "This was a great disappointment to his father, but it also caught the attention of **Pulcinella**, the 5th Harbinger.",
                "Shocked by Ajax's great strength, and curious about how he had invariably became the eye of a vortex of discord, Pulcinella inducted Ajax into the Fatui under the pretext of meting out punishment, ordering him to start from the bottom and take up the duty of serving the **Tsaritsa**.",
                "His insatiable desire for conquest would thus be constantly satiated in fighting for the Fatui, and his ever-burgeoning ego would gorge upon the elation of vanquishing mighty foes...",
                "Until at last, Ajax was chosen to be one of the Fatui Harbingers, donning the mantle of \"Childe\" Tartaglia and becoming one of the most powerful people in Snezhnaya.",
                "But becoming Tartaglia was far from his end goal. To someone who sought to conquer the world, this was but a tiny step in his journey."
            ],
            "Tartaglia's Letters to Home": [
                "\"Dearest Sister, are you all keeping well at home? Has the old man's headache gotten any better?",
                "Please send my regards to our parents and our siblings.<ref group=\"Note\">In Chinese and Japanese, he specifies \"our big brother(s) and sister(s)\" instead of \"siblings.\" In Korean, he does not even distinguish between parents and siblings, and simply says \"our family.\"</ref>",
                "I've sent some wind chill medication over from **Liyue Harbor**. It's very effective, and will probably keep him from nagging for a while. It should reach you after a few days.",
                "Apart from our father's affairs, I naturally haven't forgotten about gifts for you all.",
                "This letter should come with two kites from **Liyue**, a rattle drum, two porcelain dolls from **Inazuma**, and a crate full of various snacks.",
                "And please break it to Anthon that the residents of Liyue are just boring old ordinary humans like us.",
                "They're not made of stone, and they don't even eat stones.",
                "Do not fret for my sake, Tonia, and refrain from making trouble for anyone at home. I will be home soon. When I have seized the seven stars of Liyue and laid them at the feet of Her Majesty the Tsaritsa, I will take the first ship home, just as I promised &mdash; and you know how I always keep my promises.",
                "Yours faithfully, Your loyal knight.\""
            ],
            "Delusion": [
                "Tartaglia's **Delusion** is his old badge of honor and the proof of his strength.",
                "He still remembers with perfect clarity the day when he received his Delusion and ascended to become a member of the Harbingers.",
                "As he stood before the cold, stern Tsaritsa, **Pierro|The Jester**, the very first of the Fatui, personally pinned this insignia onto him.",
                "It was his reward for slaying many terrible beasts, and a memento of countless battles. But it was not this that brought Tartaglia joy, for honor is the natural reward of the warrior. Nor did he pay any mind to the odd looks his new \"colleagues\" gave him, for the opinions and bellyaches of others meant nothing to him.",
                "The sight of the Tsaritsa on her lofty throne alone stirred the young man's heart with respect and admiration, not merely because she opened the way for him to find an abundance of looming battles, but also because of the way she looked upon him. Her gaze was cold but pure, arrogant yet sharp.",
                "She was not only the sacrosanct Cryo **Archon** but a true warrior also.",
                "Thus did Childe, having received his Delusion, swear an oath of fealty to the one and only Tsaritsa of Snezhnaya."
            ]
        },
        "namecard": {
            "name": "Childe: Foul Legacy",
            "image": "https://static.wikia.nocookie.net/gensin-impact/images/5/50/Item_Childe_Foul_Legacy.png",
            "obtain": "Reward for reaching Friendship Level 10 with Tartaglia",
            "description": "This bears all the marks of that fellow who gallivants as he pleases across the continent with his ever-changing combat styles. Yet, his \"Foul Legacy\" was not originally his. Rather, it was taught to him by that solitary girl who dwelt in the darkest corners of the universe."
        },
        "constellation": {
            "image": "Monoceros_Caeli.png",
            "meaning": "Celestial Narwhal\n"
        },
        "quests_events": {
            "Archon Quests": "- **Chapter I**\n  - Act I: **Of the Land Amidst Monoliths**\n    - **Rite of Descension**\n    - **Dust to Dust**\n  - Act II: **Farewell, the Archaic Lord**\n    - **An Organization Known as Wangsheng**\n    - **Downtown**\n    - **Guizhong (Archon Quest)|Guizhong**\n  - Act III: **A New Star Approaches**\n    - **Heart of Glaze**\n    - **The Fond Farewell**",
            "Story Quests": "- **Monoceros Caeli Chapter** (**Tartaglia**'s story)\n  - Act I: **Mighty Cyclops' Adventure!**\n    - All parts",
            "Events": "- **Stone Harbor Treasure Journal**"
        },
        "interactions": null
    }
}